reports/local_500tunn_10inst_1000batch_10user.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
           * thousand-vus: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
thousand-vus   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
thousand-vus   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
thousand-vus   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
thousand-vus   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
thousand-vus   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
thousand-vus   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 47 complete and 0 interrupted iterations
thousand-vus   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
thousand-vus   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
thousand-vus   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 65 complete and 0 interrupted iterations
thousand-vus   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 68 complete and 0 interrupted iterations
thousand-vus   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 76 complete and 0 interrupted iterations
thousand-vus   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 77 complete and 0 interrupted iterations
thousand-vus   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 84 complete and 0 interrupted iterations
thousand-vus   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
thousand-vus   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 91 complete and 0 interrupted iterations
thousand-vus   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 97 complete and 0 interrupted iterations
thousand-vus   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 104 complete and 0 interrupted iterations
thousand-vus   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 111 complete and 0 interrupted iterations
thousand-vus   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 113 complete and 0 interrupted iterations
thousand-vus   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
thousand-vus   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
thousand-vus   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 133 complete and 0 interrupted iterations
thousand-vus   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
thousand-vus   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
thousand-vus   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
thousand-vus   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 153 complete and 0 interrupted iterations
thousand-vus   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 158 complete and 0 interrupted iterations
thousand-vus   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 166 complete and 0 interrupted iterations
thousand-vus   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 171 complete and 0 interrupted iterations
thousand-vus   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
thousand-vus   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
thousand-vus   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 186 complete and 0 interrupted iterations
thousand-vus   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 189 complete and 0 interrupted iterations
thousand-vus   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 198 complete and 0 interrupted iterations
thousand-vus   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 203 complete and 0 interrupted iterations
thousand-vus   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 208 complete and 0 interrupted iterations
thousand-vus   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 214 complete and 0 interrupted iterations
thousand-vus   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
thousand-vus   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 226 complete and 0 interrupted iterations
thousand-vus   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 233 complete and 0 interrupted iterations
thousand-vus   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 239 complete and 0 interrupted iterations
thousand-vus   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 249 complete and 0 interrupted iterations
thousand-vus   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 257 complete and 0 interrupted iterations
thousand-vus   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 262 complete and 0 interrupted iterations
thousand-vus   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
thousand-vus   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 275 complete and 0 interrupted iterations
thousand-vus   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 282 complete and 0 interrupted iterations
thousand-vus   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 286 complete and 0 interrupted iterations
thousand-vus   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
thousand-vus   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 295 complete and 0 interrupted iterations
thousand-vus   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
thousand-vus   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 306 complete and 0 interrupted iterations
thousand-vus   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 314 complete and 0 interrupted iterations
thousand-vus   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 317 complete and 0 interrupted iterations
thousand-vus   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 325 complete and 0 interrupted iterations
thousand-vus   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 333 complete and 0 interrupted iterations
thousand-vus   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 337 complete and 0 interrupted iterations
thousand-vus   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 345 complete and 0 interrupted iterations
thousand-vus   [ 100% ] 10 VUs  1m00.0s/1m0s

running (1m01.0s), 03/10 VUs, 352 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 10 VUs  1m0s

running (1m01.2s), 00/10 VUs, 355 complete and 0 interrupted iterations
thousand-vus ✓ [ 100% ] 10 VUs  1m0s

     ✗ status is 200
      ↳  78% — ✓ 278 / ✗ 77

     checks.........................: 78.30% ✓ 278      ✗ 77  
     data_received..................: 1.6 MB 27 kB/s
     data_sent......................: 204 kB 3.3 kB/s
     http_req_blocked...............: avg=302.98ms min=0s       med=251.78ms max=5.25s    p(90)=379.83ms p(95)=438.3ms 
     http_req_connecting............: avg=103.38ms min=0s       med=117.33ms max=264.94ms p(90)=150.73ms p(95)=204.63ms
     http_req_duration..............: avg=379.66ms min=0s       med=241.89ms max=10.99s   p(90)=370.36ms p(95)=416.96ms
       { expected_response:true }...: avg=372.37ms min=236.98ms med=244.47ms max=10.99s   p(90)=372.99ms p(95)=422.82ms
     http_req_failed................: 21.69% ✓ 77       ✗ 278 
     http_req_receiving.............: avg=110.85µs min=0s       med=72.48µs  max=5.59ms   p(90)=163.16µs p(95)=196.22µs
     http_req_sending...............: avg=236.61µs min=0s       med=169.35µs max=3.44ms   p(90)=454.08µs p(95)=519.14µs
     http_req_tls_handshaking.......: avg=107.59ms min=0s       med=124.1ms  max=243.05ms p(90)=136.93ms p(95)=200.41ms
     http_req_waiting...............: avg=379.31ms min=0s       med=241.41ms max=10.99s   p(90)=370.09ms p(95)=416.55ms
     http_reqs......................: 355    5.796678/s
     iteration_duration.............: avg=1.71s    min=1s       med=1.5s     max=12.27s   p(90)=1.75s    p(95)=1.97s   
     iterations.....................: 355    5.796678/s
     vus............................: 3      min=3      max=10
     vus_max........................: 10     min=10     max=10